Autodesk.Revit.DB.Structure.StickElementExtension
Presets for given Analytical Extension.

Autodesk.Revit.DB.Structure.StickElementExtension.Varies
Extension types are different at each end.

Autodesk.Revit.DB.Structure.StickElementExtension.Plane
Use a Plane for extension (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.StickElementExtension.ReferenceLevel
Bottom or top Reference Level.

Autodesk.Revit.DB.Structure.StickElementExtension.BottomOrTop
Bottom or Top of physical element.